In [1]:
import pandas as pd

# Temperature

In [2]:
median_temp = [
    ['OK',63,63,64,65],
    ['MO',65,64,66,67],
    ['KS',64,66,65,65]
]

data = pd.DataFrame(median_temp, columns=['Name','2015','2016','2017','2018'])

In [3]:
data

  Name  2015  2016  2017  2018
0   OK    63    63    64    65
1   MO    65    64    66    67
2   KS    64    66    65    65

In [4]:
(data['2015'] + data['2016'] + data['2017'] + data['2018'])/4

0    63.75
1    65.50
2    65.00
dtype: float64

In [5]:
pd.DataFrame(zip(data['Name'],(data['2015'] + data['2016'] + data['2017'] + data['2018']) / 4),
            columns=['Name','Mean'])

  Name   Mean
0   OK  63.75
1   MO  65.50
2   KS  65.00

In [6]:
data = data.set_index('Name')

In [7]:
data

      2015  2016  2017  2018
Name
OK      63    63    64    65
MO      65    64    66    67
KS      64    66    65    65

In [8]:
data.stack()

Name
OK    2015    63
      2016    63
      2017    64
      2018    65
MO    2015    65
      2016    64
      2017    66
      2018    67
KS    2015    64
      2016    66
      2017    65
      2018    65
dtype: int64

In [9]:
data = data.stack().reset_index()

In [10]:
data

   Name level_1   0
0    OK    2015  63
1    OK    2016  63
2    OK    2017  64
3    OK    2018  65
4    MO    2015  65
5    MO    2016  64
6    MO    2017  66
7    MO    2018  67
8    KS    2015  64
9    KS    2016  66
10   KS    2017  65
11   KS    2018  65

In [11]:
data.columns = ['Name','Year','Temp']

In [12]:
data

   Name  Year  Temp
0    OK  2015    63
1    OK  2016    63
2    OK  2017    64
3    OK  2018    65
4    MO  2015    65
5    MO  2016    64
6    MO  2017    66
7    MO  2018    67
8    KS  2015    64
9    KS  2016    66
10   KS  2017    65
11   KS  2018    65

In [13]:
data.groupby(['Name'])['Temp'].mean()

Name
KS    65.00
MO    65.50
OK    63.75
Name: Temp, dtype: float64

In [ ]:
data

In [ ]:
data.groupby(['Name'])['Temp'].mean()

# Flu Data

In [22]:
flu = pd.read_csv('/data/flu_2016_2017.csv')

In [23]:
flu.head()

,Country,WHOREGION,FLUREGION,Year,Week,SDATE,EDATE,SPEC_RECEIVED_NB,SPEC_PROCESSED_NB,AH1,...,AH5,ANOTSUBTYPED,INF_A,BYAMAGATA,BVICTORIA,BNOTDETERMINED,INF_B,ALL_INF,ALL_INF2,TITLE
0,Afghanistan,Eastern Mediterranean Region of WHO,Southern Asia,2016,1,2016-01-04,2016-01-10,87.0,87.0,0.0,...,0.0,2.0,13,0.0,0.0,0.0,0,13,NaN,Sporadic
1,Afghanistan,Eastern Mediterranean Region of WHO,Southern Asia,2016,2,2016-01-11,2016-01-17,70.0,70.0,0.0,...,0.0,3.0,3,0.0,0.0,1.0,1,4,NaN,Sporadic
2,Afghanistan,Eastern Mediterranean Region of WHO,Southern Asia,2016,3,2016-01-18,2016-01-24,102.0,102.0,0.0,...,0.0,2.0,2,0.0,0.0,0.0,0,2,NaN,Sporadic
3,Afghanistan,Eastern Mediterranean Region of WHO,Southern Asia,2016,4,2016-01-25,2016-01-31,77.0,77.0,0.0,...,0.0,1.0,1,0.0,0.0,2.0,2,3,NaN,No Report
4,Afghanistan,Eastern Mediterranean Region of WHO,Southern Asia,2016,5,2016-02-01,2016-02-07,98.0,0.0,0.0,...,0.0,0.0,0,0.0,0.0,0.0,0,0,NaN,No Report

In [24]:
flu.columns

Index(['Country', 'WHOREGION', 'FLUREGION', 'Year', 'Week', 'SDATE', 'EDATE',
       'SPEC_RECEIVED_NB', 'SPEC_PROCESSED_NB', 'AH1', 'AH1N12009', 'AH3',
       'AH5', 'ANOTSUBTYPED', 'INF_A', 'BYAMAGATA', 'BVICTORIA',
       'BNOTDETERMINED', 'INF_B', 'ALL_INF', 'ALL_INF2', 'TITLE'],
      dtype='object')

In [25]:
stacked = pd.DataFrame(
    flu.set_index(['Country','WHOREGION','FLUREGION','Year','Week','SDATE','EDATE','TITLE']).
    stack().
    reset_index(name='count'))

In [26]:
stacked.head()

,Country,WHOREGION,FLUREGION,Year,Week,SDATE,EDATE,TITLE,level_8,count
0,Afghanistan,Eastern Mediterranean Region of WHO,Southern Asia,2016,1,2016-01-04,2016-01-10,Sporadic,SPEC_RECEIVED_NB,87.0
1,Afghanistan,Eastern Mediterranean Region of WHO,Southern Asia,2016,1,2016-01-04,2016-01-10,Sporadic,SPEC_PROCESSED_NB,87.0
2,Afghanistan,Eastern Mediterranean Region of WHO,Southern Asia,2016,1,2016-01-04,2016-01-10,Sporadic,AH1,0.0
3,Afghanistan,Eastern Mediterranean Region of WHO,Southern Asia,2016,1,2016-01-04,2016-01-10,Sporadic,AH1N12009,3.0
4,Afghanistan,Eastern Mediterranean Region of WHO,Southern Asia,2016,1,2016-01-04,2016-01-10,Sporadic,AH3,8.0

# Wide to Long

In [14]:
median_temp = [
    ['OK',63,63,64,65],
    ['MO',65,64,66,67],
    ['KS',64,66,65,65]
]

data = pd.DataFrame(median_temp, columns=['Name','2015','2016','2017','2018'])

In [15]:
data

  Name  2015  2016  2017  2018
0   OK    63    63    64    65
1   MO    65    64    66    67
2   KS    64    66    65    65

In [18]:
pd.wide_to_long(
    data,
    ['20'],
    i='Name',
    j='year'
)

           20
Name year
OK   15    63
MO   15    65
KS   15    64
OK   16    63
MO   16    64
KS   16    66
OK   17    64
MO   17    66
KS   17    65
OK   18    65
MO   18    67
KS   18    65

# Melt

In [19]:
median_temp = [
    ['OK',63,63,64,65],
    ['MO',65,64,66,67],
    ['KS',64,66,65,65]
]

data = pd.DataFrame(median_temp, columns=['Name','2015','2016','2017','2018'])

In [20]:
data

  Name  2015  2016  2017  2018
0   OK    63    63    64    65
1   MO    65    64    66    67
2   KS    64    66    65    65

In [21]:
data.melt(id_vars=['Name'], 
          value_vars=['2015','2016','2017','2018'],
          var_name='Year',
          value_name='Temp')

   Name  Year  Temp
0    OK  2015    63
1    MO  2015    65
2    KS  2015    64
3    OK  2016    63
4    MO  2016    64
5    KS  2016    66
6    OK  2017    64
7    MO  2017    66
8    KS  2017    65
9    OK  2018    65
10   MO  2018    67
11   KS  2018    65